In [1]:
import pandas as pd
import numpy as np
import missingno as msno
print("msno:",msno.__version__)
print("pd:",pd.__version__)
print("np:",np.__version__)

msno: 0.4.2
pd: 2.2.3
np: 1.26.4

In [ ]:
exam1 = [89,85,93,83]
labels  = ['Student A', 'Student B', 'Student C', 'Student D']

pd.Series(exam1,labels)

In [ ]:
pd.Series(exam1,labels)['Student D']

In [ ]:
d = {s:p for s,p in zip(labels,exam1)}
d

In [ ]:
pd.Series(d)

In [ ]:
exam2 = [74,56,44,92]

e1 = pd.Series(exam1,labels)
e2 = pd.Series(exam2,labels)

In [ ]:
e1 + e2

In [ ]:
e1 * e2

In [ ]:
e1 / 5

In [ ]:
df = pd.DataFrame({'e1':exam1, 'e2':exam2},index=labels)
df

In [ ]:
df['e1']

In [ ]:
type(df['e1'])

In [ ]:
data = np.array([exam1,exam2])
data.T

In [ ]:
df = pd.DataFrame(data.T,index=labels,columns=['e1','e2'])
df

In [ ]:
df.to_numpy()

In [ ]:
df.shape

In [ ]:
df['e1']

In [ ]:
df['e3'] = [67,59,79,84]
df

In [ ]:
df['semester1'] = df['e1'] + df['e2'] + df['e3']
df

In [ ]:
df[['e1','e2']]

In [ ]:
df.loc['Student C']

In [ ]:
df.loc['Student C','e2']

In [ ]:
df.iloc[2]

In [ ]:
df.iloc[-2:,0:3]

In [ ]:
df['e2'] > 70

In [ ]:
df[df['e2'] > 70]

In [ ]:
df[(df['e2']<50)|(df['e2']>90)]

In [ ]:
df.drop('semester1',axis=1)

In [ ]:
df

In [ ]:
df.drop(['e3','semester1'],axis=1,inplace=False)
df

In [ ]:
df.drop('Student B',inplace=False)
df

In [ ]:
df.reset_index()

In [ ]:
df_new_index = df.reset_index()
df_new_index

In [ ]:
df_new_index['student_name'] = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index

In [ ]:
df_new_index.set_index('student_name')

In [ ]:
df_new_index2 = df.reset_index()
df_new_index2

In [ ]:
df_new_index2.index = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index2

In [ ]:
df

In [ ]:
df.rename(columns={'e1':'exam1','e2':'exam2','e3':'exam3'})

In [ ]:
df.rename(str.upper, axis='columns')

In [ ]:
df = pd.DataFrame({'A':[100,44,56,99,85,100],
                  'B':['Panda','Snake','Snake','Rat','Dog','Panda']})
df

In [ ]:
df['B'].unique()

In [ ]:
df['B'].nunique()

In [ ]:
df['B'].value_counts()

In [ ]:
df['B'].value_counts(normalize=True)

In [ ]:
df.sort_values(by='A')

In [ ]:
df.sort_values(by='A',ascending=False)

In [ ]:
df.drop_duplicates()

In [ ]:
df

In [ ]:
exam1 = [89,85,93,83]
exam2 = [74,56,44,92]
exam3=[67,59,79,84]
df = pd.DataFrame({'e1':exam1, 'e2':exam2, 'e3':exam3}, index=labels)
df['semester1'] = df['e1']+df['e2']+df['e3']
df

In [ ]:
schools = ['High School X','High School X','High School Y','High School Y']
multi_index_list = [(school,student) for school,student in zip(schools,df.index)]
multi_index_list

In [ ]:
df.index = pd.MultiIndex.from_tuples(multi_index_list,names=['School','Student'])
df

In [ ]:
exam1 = [89,85,93,83]
exam2 = [74,56,44,92]
exam3=[67,59,79,84]
df = pd.DataFrame({'e1':exam1, 'e2':exam2, 'e3':exam3}, index=labels)
df['semester1'] = df['e1']+df['e2']+df['e3']
df

In [ ]:
df.set_index([pd.Index(['High School X','High School X','High School Y','High School Y']), df.index],inplace=True)
df

In [ ]:
df.index.names = ['School','Student']
df

In [ ]:
df.loc['High School X']

In [ ]:
df.loc['High School X'].iloc[1]

In [ ]:
df.xs('High School Y')

In [ ]:
df.xs(('High School Y','Student D'))

In [ ]:
df.xs('Student D',level='Student')

In [ ]:
df

In [ ]:
semester2 = np.random.randint(1,100,(4,3))
semester2

In [ ]:
df[['e4', 'e5', 'e6']] = semester2
df

In [ ]:
df.drop(['semester1'],axis=1,inplace=True)
df

In [ ]:
# Create a MultiIndex DataFrame
df_multi = pd.DataFrame({
    ('Semester 1', 'e1'): df['e1'],
    ('Semester 1', 'e2'): df['e2'],
    ('Semester 1', 'e3'): df['e3'],
    ('Semester 2', 'e4'): df['e4'],
    ('Semester 2', 'e5'): df['e5'],
    ('Semester 2', 'e6'): df['e6']
}, index=df.index)

df_multi

In [ ]:
# Define the levels for the MultiIndex
semesters = ['Semester 1', 'Semester 1', 'Semester 1', 'Semester 2', 'Semester 2', 'Semester 2']
exams = ['Exam 1', 'Exam 2', 'Exam 3', 'Exam 4', 'Exam 5', 'Exam 6']

# Set the MultiIndex for columns
df.columns = pd.MultiIndex.from_arrays([semesters, exams], names=['Semester', 'Exam'])
df

In [ ]:
df = pd.DataFrame({'Category':['Games','Games','Games',

                               'Film&Video','Film&Video','Film&Video'],

                  'Project_Title':['The Last Faith','Magic Puzzles','Dinosaur Fossil Hunter',

                                   'Beyond Your Eyes','5150','8-Bit Wars'],

                  'Pledged':[92774,2873519,7962,

                             276,23963,6950],

                  'Country':['UK','USA','Poland',

                             'Bulgaria','USA','UK'],

                  'Date_Start':['2020-03-21','2020-03-11','2020-04-16',

                                '2020-02-09','2020-04-10','2020-03-19']})
df

In [ ]:
df.groupby('Category')

In [ ]:
df.groupby('Category').sum()

In [ ]:
numeric_cols = df.select_dtypes(include=['number']).columns
df.groupby('Category')[numeric_cols].mean()

In [ ]:
df.groupby('Category').count()

In [ ]:
df

In [ ]:
df['Date_Start'] = pd.to_datetime(df['Date_Start'])

In [ ]:
df

In [ ]:
df.groupby(pd.Grouper(key='Date_Start',freq='ME')).sum()

In [ ]:
df.groupby(pd.Grouper(key='Date_Start',freq='ME')).agg({'Pledged':'sum','Project_Title':'count'})

In [ ]:
numeric_cols = df.select_dtypes(include=['number']).columns
df.groupby(['Country','Category'])[numeric_cols].sum()

In [83]:
df_with_nulls = pd.DataFrame({'A':[1,100,np.nan,1000,10000],
                             'B':[2,4,2,4,np.nan],
                             'C':[40,np.nan,20,np.nan,np.nan]})
df_with_nulls

         A    B     C
0      1.0  2.0  40.0
1    100.0  4.0   NaN
2      NaN  2.0  20.0
3   1000.0  4.0   NaN
4  10000.0  NaN   NaN

In [ ]:
print(df_with_nulls.isnull().mean())
print()
print(df_with_nulls.isnull().sum())

In [ ]:
df_with_nulls[df_with_nulls['C'].isnull()]

In [ ]:
msno.matrix(df_with_nulls)

In [85]:
df_with_nulls.dropna()

     A    B     C
0  1.0  2.0  40.0

In [84]:
df_with_nulls.dropna(thresh=2)

        A    B     C
0     1.0  2.0  40.0
1   100.0  4.0   NaN
2     NaN  2.0  20.0
3  1000.0  4.0   NaN

In [86]:
df_with_nulls.dropna(thresh=3,axis=1)

         A    B
0      1.0  2.0
1    100.0  4.0
2      NaN  2.0
3   1000.0  4.0
4  10000.0  NaN

In [87]:
df_with_nulls.fillna('NOWA WARTOŚĆ')

              A             B             C
0           1.0           2.0          40.0
1         100.0           4.0  NOWA WARTOŚĆ
2  NOWA WARTOŚĆ           2.0          20.0
3        1000.0           4.0  NOWA WARTOŚĆ
4       10000.0  NOWA WARTOŚĆ  NOWA WARTOŚĆ

In [90]:
df_with_nulls.fillna(df_with_nulls.mean())

          A    B     C
0      1.00  2.0  40.0
1    100.00  4.0  30.0
2   2775.25  2.0  20.0
3   1000.00  4.0  30.0
4  10000.00  3.0  30.0

In [95]:
df_with_nulls.ffill()

         A    B     C
0      1.0  2.0  40.0
1    100.0  4.0  40.0
2    100.0  2.0  20.0
3   1000.0  4.0  20.0
4  10000.0  4.0  20.0

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],

                    'B': ['B0', 'B1', 'B2', 'B3'],

                    'C': ['C0', 'C1', 'C2', 'C3'],

                    'D': ['D0', 'D1', 'D2', 'D3']},

                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],

                    'B': ['B4', 'B5', 'B6', 'B7'],

                    'C': ['C4', 'C5', 'C6', 'C7'],

                    'D': ['D4', 'D5', 'D6', 'D7']},

                    index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],

                    'B': ['B8', 'B9', 'B10', 'B11'],

                    'C': ['C8', 'C9', 'C10', 'C11'],

                    'D': ['D8', 'D9', 'D10', 'D11']},

                    index=[8, 9, 10, 11])

In [3]:
print(df1)
print(df2)
print(df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [4]:
def make_keys(n):
    return [f'key{n}' for n in range(n)]
left = df1.copy()
left['key'] = make_keys(4)
right = df3.copy()
right['key'] = make_keys(4)

In [5]:
left

    A   B   C   D   key
0  A0  B0  C0  D0  key0
1  A1  B1  C1  D1  key1
2  A2  B2  C2  D2  key2
3  A3  B3  C3  D3  key3

In [6]:
right

      A    B    C    D   key
8    A8   B8   C8   D8  key0
9    A9   B9   C9   D9  key1
10  A10  B10  C10  D10  key2
11  A11  B11  C11  D11  key3

In [7]:
pd.merge(left,right,how='inner',on='key')

  A_x B_x C_x D_x   key  A_y  B_y  C_y  D_y
0  A0  B0  C0  D0  key0   A8   B8   C8   D8
1  A1  B1  C1  D1  key1   A9   B9   C9   D9
2  A2  B2  C2  D2  key2  A10  B10  C10  D10
3  A3  B3  C3  D3  key3  A11  B11  C11  D11

In [8]:
new_right = pd.DataFrame({'E': ['E1','E2','E3','E4','E5','E6'],
                          'key': make_keys(6)})
new_right

    E   key
0  E1  key0
1  E2  key1
2  E3  key2
3  E4  key3
4  E5  key4
5  E6  key5

In [10]:
pd.merge(left,new_right,how='outer',on='key')

     A    B    C    D   key   E
0   A0   B0   C0   D0  key0  E1
1   A1   B1   C1   D1  key1  E2
2   A2   B2   C2   D2  key2  E3
3   A3   B3   C3   D3  key3  E4
4  NaN  NaN  NaN  NaN  key4  E5
5  NaN  NaN  NaN  NaN  key5  E6

In [12]:
other = pd.DataFrame({'E':['E1','E2','E3','E4','E5','E6']},index=['B1','B2','B3','B4','B5','B6'])
other

     E
B1  E1
B2  E2
B3  E3
B4  E4
B5  E5
B6  E6

In [13]:
left.join(other,on='B')

    A   B   C   D   key    E
0  A0  B0  C0  D0  key0  NaN
1  A1  B1  C1  D1  key1   E1
2  A2  B2  C2  D2  key2   E2
3  A3  B3  C3  D3  key3   E3

In [14]:
left.join(other,on='B',how='inner')

    A   B   C   D   key   E
1  A1  B1  C1  D1  key1  E1
2  A2  B2  C2  D2  key2  E2
3  A3  B3  C3  D3  key3  E3

In [15]:
left

    A   B   C   D   key
0  A0  B0  C0  D0  key0
1  A1  B1  C1  D1  key1
2  A2  B2  C2  D2  key2
3  A3  B3  C3  D3  key3

In [16]:
right

      A    B    C    D   key
8    A8   B8   C8   D8  key0
9    A9   B9   C9   D9  key1
10  A10  B10  C10  D10  key2
11  A11  B11  C11  D11  key3

In [8]:
left.dtypes

A      object
B      object
C      object
D      object
key    object
dtype: object

In [9]:
right.dtypes

A      object
B      object
C      object
D      object
key    object
dtype: object

In [13]:
left['key'] = left['key'].astype(str)
right['key'] = right['key'].astype(str)

In [28]:
result = left.join(right.set_index('key'), on='key', lsuffix='_left', rsuffix='_right')
print(result)

  A_left B_left C_left D_left   key A_right B_right C_right D_right
0     A0     B0     C0     D0  key0      A8      B8      C8      D8
1     A1     B1     C1     D1  key1      A9      B9      C9      D9
2     A2     B2     C2     D2  key2     A10     B10     C10     D10
3     A3     B3     C3     D3  key3     A11     B11     C11     D11

In [3]:
df = pd.read_excel('myExcelFile.xlsx', sheet_name='my_data')